$(document).ready(function() {
  
  /******************
        CONTENT
  ******************/
  
  var content = { 
    chapters: [
      {
        id: "ancient-greece",
        title: "הרחם המשוטט",
        period: "יוון העתיקה",
        desc: "יוון העתיקה היא תקופה בהיסטוריה של יוון שנמשכה למעלה מאלף שנים במהלך העת העתיקה עד לעליית הנצרות ביוון. התרבות היוונית העתיקה ומורשתה נחשבת בעיני היסטוריונים רבים כערש התרבות המערבית אשר הייתה בעלת השפעה רבה על תרבות האימפריה הרומית ועל כלל התרבויות האירופאיות עד לימינו. ",
        clipUrl: "..."
      },
      {
        id: "dark-ages",
        title: "דיבוק",
        period: "ימי הביניים",
        desc: "יְמֵי הַבֵּינַיִם (בלטינית: Medium Aevum) הם תקופה במהלך ההיסטוריה האירופית שתחילתה עם סיום העת העתיקה וסופה עם הופעת הרנסאנס ותחילתה של העת החדשה. המונח הופיע לראשונה באיטליה במהלך המאה ה-15, לציון העידן שבין נפילתה של הקיסרות הרומית בשנת 476 במאה החמישית, עד 1492 שנת גילוי יבשת אמריקה במאה ה-15 (או התקופה הנוכחית, לטינית: praesens tempus).",
        clipUrl: "..."
      },
      {
        id: "enlightment",
        title: "משקולת",
        period: "עידן הנאורות",
        desc: "עידן הנאורות או עידן האורות (באנגלית: Age of Enlightenment) הוא כינוי לתנועה אינטלקטואלית באירופה, ששמה לעצמה למטרה לבסס מוסר, אסתטיקה וידע הנשענים על רציונליות והנחת יסוד לוגוצנטרית. מנהיגי התנועה ראו בעצמם אליטה אמיצה של אינטלקטואלים המובילים את העולם לעבר קידמה מתוך תקופה ארוכה של חוסר רציונליות, חוסר בגרות ועריצות, שהחלה בתקופת ימי הביניים, אותה כינו העת החשוכה. התנועה סיפקה את הבסיס הפילוסופי למהפכה האמריקאית ולמהפכה הצרפתית, כמו גם לעליית הקפיטליזם והבורגנות.",
        clipUrl: "..."
      },
      {
        id: "victorian",
        title: "מגיפה",
        period: "התקופה הוויקטוריאנית",
        desc: "התקופה הוויקטוריאנית (באנגלית: Victorian era) בבריטניה הייתה תקופת השיא במהפכה התעשייתית הבריטית ואף שיאה של האימפריה הבריטית. אף על פי שבדרך כלל המושג מתייחס לתקופת מלכותה של המלכה ויקטוריה, בין השנים 1837 ועד 1901, היסטוריונים אחדים סוברים כי התקופה הוויקטוריאנית – על פי מאפייניה הייחודיים מבחינה חברתית – התחילה עם קבלת חוק הרפורמה משנת 1832. לתקופה הוויקטוריאנית קדמה התקופה הג'ורג'יאנית ולאחריה באה התקופה האדוארדית.",
        clipUrl: "..."
      },
      {
        id: "modern-times",
        title: "זיכרון",
        period: "העידן המודרני",
        desc: "העת החדשה (או העידן המודרני), היא התקופה השלישית והנוכחית בתיקוף ההיסטוריה, על פי המקובל בהיסטוריוגרפיה המערבית. ראשיתה של העת החדשה נקבעה בחלק ניכר מההיסטוריוגרפיה המערבית בשנת 1492, השנה בה גילה קולומבוס את יבשת אמריקה.",
        clipUrl: "..."
      }
    ]
  };

  /*********************
        HANDLEBARS
  *********************/
  
  var source   = $("#chapter-template").html();
  var template = Handlebars.compile(source);
  
  $("#content-container").html(template(content));
  
    
  /******************
        SLIDER
  ******************/
  
  $('.owl-carousel').owlCarousel({
    rtl: true,
    items: 1,
    center: true,
    startPosition: 3
  });
  
});
